<?php

// 8 data Types

// 1. int
$int = 123;

// 2. float
$float = 2.15;

// 3. string
$str = 'Some text';

// 4. boolean
$bool = true;

// 5. array
$arr = [1, 2, 3];

// 6. object
class MyClass {}
$object = new MyClass();

// 7. resource
//$file = fopen('C:/test', 'r');
//$file = fopen('C:/test', 'w+');

// 8. null
// var_dump(null);

// ****************************************************

// Адский пример приоритетности операторов

$a = 1;
$a += ++$a + $a++;
// сначала преинкремент
// $a += 2 + $a++;
// затем $a становится везде равен 2
// $a += 2 + 2++;
// затем $a становится везде равен 2
// 2 += 2 + 3;
// и это выражение становится
// $a = 7

// $a = 7
var_dump($a++);
// 7, постинкремент делает из $a = 8

// $a = 8, преинкремент делает из $a = 9
var_dump(++$a);
// 9


